import React from 'react';
import { Card, Row } from 'antd';

const Disclaimer = () => (
    <Card>
        <Row className="info"><h2>免责申明</h2></Row>
        感谢您选择“鸢尾适航管理辅助系统”平台，本声明包含本网站网络使用的有关条款。
        <br /><br />
        <strong>凡浏览并使用本网站及相关网页的用户，均视为已明示表示接受以下条款：</strong>
        <br /><br />
        1.本网站所提供的产品及服务只适用中国大陆地区并为中国法律所允许的用户，所发布的资料无意提供给中国大陆地区以外的国家或地区居民使用。
        <br /><br />
        2.本网站所有内容和服务，包括但不限于网站的整体结构、网页设计、文字、图片、图表、软件、视频文件、音频文件、源代码、广告以及本网站为用户提供的其它信息或资料，其知识产权属本平台所有。未经本网站书面许可，任何人不得为了商业目的进行复制或者以其它方式进行非法使用。任何未经授权许可而使用本网站内容的行为均属于违法行为,本网站保留追究相关使用人法律责任的权利。
        <br /><br />
        3.本网站为用户提供适航管理相关服务，需要对客户资质进行评估，并非所有的客户都可以获得本网站的所有产品和服务。您是否符合享受产品和服务的条件，最终的解释权归本网站。我们保留对该网站包含的信息和资料及其显示的条款、条件和说明变更的权利。
        <br /><br />
        4.任何在本网站出现或发送给您的信息包括但不限于通知、预测、提醒、邮件、直接的或暗示的指示均只作为参考，您须对在本网站任何自主决定的行为负责。
        <br /><br />
        5.本网站提供的电台执照管理、航空器管理、适航指令订阅信息等均仅供您参考。本网站所提供的信息，力求但不保证数据的准确性，如有错漏，请以国家指定机构的公示信息为准。本网站不对因本网站资料全部或部分内容产生的或因依赖该资料而引致的任何损失承担任何责任。
        <br /><br />
        6.凡通过本网站与其他网站的链接，而获得其所提供的网上资料及内容，您需要依赖于自己的独立判断并对此作出的判断承担全部责任，本网站不承担任何责任。
        <br /><br />
        7.本网站不为于本网站使用的任何第三方软件的准确性、安全性、时效性、功能或性能作任何声明或保证。
        <br /><br />
        8.本网站发布的信息来源为第三方的产品发布机构或平台，本网站将明示信息来源供您参考，但申明不对发布产品信息的准确性、完整性及时效性负责，对于发布信息的真实性及全部处理决策应均由您自行决策并承担全部责任，并自行承担全部风险。
        <br /><br />
        9.本网站某些部分或网页可能包括单独条款和条件，作为对本条款和条件的补充，如果有任何冲突，该等附加条款和条件将对相关部分或网页适用。
        <br /><br />
        10.互联网传输可能会受到干扰，中断、延迟或数据错误，本网站对于非本网站能控制的通讯设施故障可能引致的数据之准确性或及时性不负任何责任。
        <br /><br />
        11.本网站并不就以下事项作出声明或保证：使用本网站时不会中断、出现延误、故障、错误或遗漏或丢失传送的资料；或不会传播病毒或其他污染或毁灭性的产物；或您的电脑系统不会受损害。您须负全责为数据和/或设备作充分保护和备份，并负全责采取合理而适当的预防措施以扫描电脑病毒或其他毁灭性产物。本网站在编制本网站所载信息和资料时已力求审慎。但本网站只能按目前现状提供有关信息，并不作任何明示或暗示的保证。尤其是不作不侵犯版权、资料保密、准确性、合适性或不含计算机病毒等担保。
        <br /><br />
        免责申明最后更新时间: 2018年10月31日。
        <br />
        <br />
        <br />
        <strong>重要事项：您进入本网址及浏览其任何网页，即表示您明确知晓并同意遵守上述条款。</strong>
    </Card>
);

export default Disclaimer;